## Plan Result (sbox-aks)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_resource_group.kubernetes_resource_group[&#34;00&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.update_checker[0]
* Update
  * module.kubernetes[&#34;00&#34;].azapi_resource.service_operator_credential[0]
* Replace
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.global_registry_acrpull[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.project_acrpull[0]
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.uami_rg_identity_operator[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.kubernetes_resource_group["00"] will be created
  + resource "azurerm_resource_group" "kubernetes_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cft-sbox-00-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.kubernetes["00"].azapi_resource.service_operator_credential[0] will be updated in-place
  ~ resource "azapi_resource" "service_operator_credential" {
      ~ body                      = jsonencode(
            {
              - properties = {
                  - audiences = [
                      - "api://AzureADTokenExchange",
                    ]
                  - issuer    = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/0333a856-78cb-4ac6-984f-b195a1f78eef/"
                  - subject   = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default"
                }
            }
        ) -> (known after apply)
        id                        = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi/federatedIdentityCredentials/cft-sbox-00-aks"
        name                      = "cft-sbox-00-aks"
      ~ output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        # (5 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + automatic_channel_upgrade           = "patch"
      + dns_prefix                          = "k8s-cft-sbox-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.25"
      + location                            = "uksouth"
      + name                                = "cft-sbox-00-aks"
      + node_resource_group                 = "cft-sbox-00-aks-node-rg"
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "cft-sbox-00-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Paid"
      + tags                                = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workload_identity_enabled           = true

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              + (sensitive value),
            ]
          + azure_rbac_enabled     = false
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 30
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.25"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "application"  = "core"
              + "autoShutdown" = "true"
              + "builtFrom"    = "hmcts/aks-cft-deploy"
              + "businessArea" = "CFT"
              + "criticality"  = "Low"
              + "environment"  = "sandbox"
              + "expiresAfter" = "3000-01-01"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D4ds_v5"
          + vnet_subnet_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-00"
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
            ]
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "5m"
        }

      + linux_profile {
          + admin_username = "k8sadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCeRwSzSKJfjmIVQ6CUld/M3vF9Hcfxh5cLBa1BV+UZDh5p1gKoB0xRegSFdncfup1qMAhrZtgBpaclLiYUfe8ZajPp1Lmva9AJuK/UktzF9stZie7LDpflEdVBXlSZw3AtAWxF2vIkEeW+NVYlGAJOQlasFkmGTkco+O1wUM4LGI3YNHm7r70rnmHT2djoR1t4x1jlPCrXaJEhvtyxf01Dwjq2nWaox3puJtHs5DLFpEIvXvHwQWssFFyKIuwkm4FewHKJSbCahyaCb+ac10MAZg9vZnWq0EYOe1nLn7c3538yJ9WJh7jRFZDza6ab9HVb5hgJ3/t/K+EzkU/XGSEJ"
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 10
      + max_pods              = 30
      + min_count             = 4
      + mode                  = "User"
      + name                  = "linux"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = []
      + orchestrator_version  = "1.25"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4ds_v5"
      + vnet_subnet_id        = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-00"
      + zones                 = [
          + "1",
        ]

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + max_surge = "33%"
        }
    }

  # module.kubernetes["00"].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                       = "DiagLogAnalytics"
      + target_resource_id         = (known after apply)

      + log {
          + category = "cluster-autoscaler"
          + enabled  = true
        }
      + log {
          + category = "guard"
          + enabled  = true
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.kubernetes["00"].azurerm_role_assignment.aks_auto_shutdown[0] will be created
  + resource "azurerm_role_assignment" "aks_auto_shutdown" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.genesis_managed_identity_operator[0] must be replaced
-/+ resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi/providers/Microsoft.Authorization/roleAssignments/13943eb3-97b3-fb4b-b82f-253ae8125224" -> (known after apply)
      ~ name                             = "13943eb3-97b3-fb4b-b82f-253ae8125224" -> (known after apply)
      ~ principal_id                     = "870b83f0-55dd-4645-a1b8-d6f26a2e2f7a" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.global_registry_acrpull[0] must be replaced
-/+ resource "azurerm_role_assignment" "global_registry_acrpull" {
      ~ id                               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.Authorization/roleAssignments/f9dc40bb-e5b7-7cf7-2875-e776711c5b9f" -> (known after apply)
      ~ name                             = "f9dc40bb-e5b7-7cf7-2875-e776711c5b9f" -> (known after apply)
      ~ principal_id                     = "870b83f0-55dd-4645-a1b8-d6f26a2e2f7a" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-aks-node-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["00"].azurerm_role_assignment.project_acrpull[0] must be replaced
-/+ resource "azurerm_role_assignment" "project_acrpull" {
      ~ id                               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.Authorization/roleAssignments/904a3ab0-039d-1317-bdcf-b5847b23dc4c" -> (known after apply)
      ~ name                             = "904a3ab0-039d-1317-bdcf-b5847b23dc4c" -> (known after apply)
      ~ principal_id                     = "870b83f0-55dd-4645-a1b8-d6f26a2e2f7a" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.uami_rg_identity_operator[0] must be replaced
-/+ resource "azurerm_role_assignment" "uami_rg_identity_operator" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/managed-identities-sbox-rg/providers/Microsoft.Authorization/roleAssignments/d2065ebf-4a14-41ee-9e7f-f6fa91a6a21c" -> (known after apply)
      ~ name                             = "d2065ebf-4a14-41ee-9e7f-f6fa91a6a21c" -> (known after apply)
      ~ principal_id                     = "870b83f0-55dd-4645-a1b8-d6f26a2e2f7a" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.kubernetes["00"].azurerm_role_assignment.update_checker[0] will be created
  + resource "azurerm_role_assignment" "update_checker" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "69c0f21d-e37c-41c2-8e16-b6873e941cea"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 11 to add, 1 to change, 4 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster has been deleted
  - resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-00-aks" -> null
        name                                = "cft-sbox-00-aks"
      - oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/0333a856-78cb-4ac6-984f-b195a1f78eef/" -> null
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (27 unchanged attributes hidden)

      - kubelet_identity {
          - object_id                 = "870b83f0-55dd-4645-a1b8-d6f26a2e2f7a" -> null
            # (2 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":459,"Program":"tfcmt","SHA1":"","Target":"sbox-aks","Vars":{}} -->